{
	"FormatVersion": 1,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "Add Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Calculate Shanten"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "DRAGON"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "DRAGON CHUN"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "DRAGON HAKU"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "DRAGON HATSU"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Debug Print"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Discard Tiles"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Draw Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "ETile Id"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "ETile Id MAX"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "ETile Kind"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "ETile Kind MAX"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Get Hand"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Get Tile Id"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Get Tile Kind"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Get Tile Name"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Get Tile Owner"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Get Tile Value"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "HONOR"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Hand Open"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "INVALID"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Is Hand Open"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Is Next Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Is Nine"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Is One"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Is One or Nine"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Is Red Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Dragon Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Game Mode"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Game State"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Pin Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Player Controller"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Player Hand"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Sou Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Table"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Wan Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Mahjong Wind Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "NONE"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 1"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 2"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 3"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 4"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 5"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 6"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 7"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 8"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "PIN 9"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Red Tile"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Reset Tiles"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 1"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 2"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 3"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 4"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 5"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 6"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 7"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 8"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SOU 9"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "SUITE"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Set Draw"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Sort"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "TILE ID MAX"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Tile Id"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Tile Owner"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Tile Value"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "Tiles"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 1"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 2"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 3"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 4"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 5"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 6"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 7"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 8"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WAN 9"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WIND"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WIND NAN"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WIND PEI"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WIND SHA"
			},
			"Translation":
			{
				"Text": ""
			}
		},
		{
			"Source":
			{
				"Text": "WIND TON"
			},
			"Translation":
			{
				"Text": ""
			}
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "Mahjong",
			"Subnamespaces": [
				{
					"Namespace": "Tile",
					"Children": [
						{
							"Source":
							{
								"Text": "1 Pin"
							},
							"Translation":
							{
								"Text": "一筒"
							}
						},
						{
							"Source":
							{
								"Text": "1 Sou"
							},
							"Translation":
							{
								"Text": "一索"
							}
						},
						{
							"Source":
							{
								"Text": "1 Wan"
							},
							"Translation":
							{
								"Text": "一萬"
							}
						},
						{
							"Source":
							{
								"Text": "2 Pin"
							},
							"Translation":
							{
								"Text": "三筒"
							}
						},
						{
							"Source":
							{
								"Text": "2 Sou"
							},
							"Translation":
							{
								"Text": "二索"
							}
						},
						{
							"Source":
							{
								"Text": "2 Wan"
							},
							"Translation":
							{
								"Text": "二萬"
							}
						},
						{
							"Source":
							{
								"Text": "3 Pin"
							},
							"Translation":
							{
								"Text": "三筒"
							}
						},
						{
							"Source":
							{
								"Text": "3 Sou"
							},
							"Translation":
							{
								"Text": "三索"
							}
						},
						{
							"Source":
							{
								"Text": "3 Wan"
							},
							"Translation":
							{
								"Text": "三萬"
							}
						},
						{
							"Source":
							{
								"Text": "4 Pin"
							},
							"Translation":
							{
								"Text": "四筒"
							}
						},
						{
							"Source":
							{
								"Text": "4 Sou"
							},
							"Translation":
							{
								"Text": "四索"
							}
						},
						{
							"Source":
							{
								"Text": "4 Wan"
							},
							"Translation":
							{
								"Text": "四萬"
							}
						},
						{
							"Source":
							{
								"Text": "5 Pin"
							},
							"Translation":
							{
								"Text": "五筒"
							}
						},
						{
							"Source":
							{
								"Text": "5 Sou"
							},
							"Translation":
							{
								"Text": "五索"
							}
						},
						{
							"Source":
							{
								"Text": "5 Wan"
							},
							"Translation":
							{
								"Text": "五萬"
							}
						},
						{
							"Source":
							{
								"Text": "6 Pin"
							},
							"Translation":
							{
								"Text": "六筒"
							}
						},
						{
							"Source":
							{
								"Text": "6 Sou"
							},
							"Translation":
							{
								"Text": "六索"
							}
						},
						{
							"Source":
							{
								"Text": "6 Wan"
							},
							"Translation":
							{
								"Text": "六萬"
							}
						},
						{
							"Source":
							{
								"Text": "7 Pin"
							},
							"Translation":
							{
								"Text": "七筒"
							}
						},
						{
							"Source":
							{
								"Text": "7 Sou"
							},
							"Translation":
							{
								"Text": "七索"
							}
						},
						{
							"Source":
							{
								"Text": "7 Wan"
							},
							"Translation":
							{
								"Text": "七萬"
							}
						},
						{
							"Source":
							{
								"Text": "8 Pin"
							},
							"Translation":
							{
								"Text": "八筒"
							}
						},
						{
							"Source":
							{
								"Text": "8 Sou"
							},
							"Translation":
							{
								"Text": "八索"
							}
						},
						{
							"Source":
							{
								"Text": "8 Wan"
							},
							"Translation":
							{
								"Text": "八萬"
							}
						},
						{
							"Source":
							{
								"Text": "9 Pin"
							},
							"Translation":
							{
								"Text": "九筒"
							}
						},
						{
							"Source":
							{
								"Text": "9 Sou"
							},
							"Translation":
							{
								"Text": "九索"
							}
						},
						{
							"Source":
							{
								"Text": "9 Wan"
							},
							"Translation":
							{
								"Text": "九萬"
							}
						},
						{
							"Source":
							{
								"Text": "East Wind"
							},
							"Translation":
							{
								"Text": "東"
							}
						},
						{
							"Source":
							{
								"Text": "Green Dragon"
							},
							"Translation":
							{
								"Text": "發"
							}
						},
						{
							"Source":
							{
								"Text": "North Wind"
							},
							"Translation":
							{
								"Text": "北"
							}
						},
						{
							"Source":
							{
								"Text": "Red Dragon"
							},
							"Translation":
							{
								"Text": "中"
							}
						},
						{
							"Source":
							{
								"Text": "South Wind"
							},
							"Translation":
							{
								"Text": "南"
							}
						},
						{
							"Source":
							{
								"Text": "West Wind"
							},
							"Translation":
							{
								"Text": "西"
							}
						},
						{
							"Source":
							{
								"Text": "White Dragon"
							},
							"Translation":
							{
								"Text": "白"
							}
						}
					]
				},
				{
					"Namespace": "Tiles",
					"Children": [
						{
							"Source":
							{
								"Text": "Invalid Tile"
							},
							"Translation":
							{
								"Text": "不可な牌"
							}
						}
					]
				}
			]
		}
	]
}